docs/leets/0062-Unique-Paths.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0062. Unique Paths</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-05-30
</div>
<div id="content" class="content">
<header>
<h1 class="title">0062. Unique Paths</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e2051b">Problem Overview</a></li>
<li><a href="#org20a9acd">Solution Outline</a></li>
<li><a href="#orgf62ffa8">Setup and Testing Skeleton</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0e2051b" class="outline-2">
<h2 id="org0e2051b">Problem Overview</h2>
<div class="outline-text-2" id="text-org0e2051b">
<p>
The problem "Unique Paths" requires determining the number of unique paths from the top-left corner to the bottom-right corner of an m x n grid. The only allowed moves are either down or right.
</p>
</div>
</div>


<div id="outline-container-org20a9acd" class="outline-2">
<h2 id="org20a9acd">Solution Outline</h2>
<div class="outline-text-2" id="text-org20a9acd">
<ul class="org-ul">
<li><b><b>Preferred Structure:</b></b> Use a 2D array (matrix) for dynamic programming (DP).</li>
<li><b><b>Brute Force vs Optimal Solution:</b></b> 
<ul class="org-ul">
<li>Brute Force: Explore all possible paths recursively.</li>
<li>Optimal Solution: Use dynamic programming to store the number of paths to each cell.</li>
</ul></li>
<li><b><b>Algorithm Choice:</b></b> Dynamic programming is most suitable. It has a time complexity of O(m*n) and space complexity of O(m*n).</li>
</ul>
</div>
</div>
