docs/leets/0062-Unique-Paths.org
* Setup and Testing Skeleton

#+begin_src js
  /**
   ,* Unique Paths - Determine the number of unique paths from top-left to bottom-right in a grid.
   ,* @param {number} m - The number of rows.
   ,* @param {number} n - The number of columns.
   ,* @returns {number} - The number of unique paths.
   ,*/
  function uniquePaths(cols, rows) {
      function rec(col, row) {
          if (col >= cols) {
              return null;
          }

          if (row >= rows) {
              return null;
          }
          return {col, row};
      }


      if (cols === 0 || rows  === 0) {
          return 0;
      }

      const dp = Array(cols).fill(1).map(() => Array(rows).fill(0));

      console.table(dp);

      let stack = [];

      dp[0][0] = 1;
      stack.push(rec(0,0));
      while (stack.length > 0) {
          let c = stack.pop();
          const right = rec(c.col + 1, c.row);
          const bot = rec(c.col, c.row + 1);

          // console.log(`right = ${JSON.stringify(right)}; bot = ${JSON.stringify(bot)};`)

          if (right) {

              dp[right.col][right.row] += 1;
              stack.push(right);
          }

          if (bot) {
              dp[bot.col][bot.row] += 1;
              stack.push(bot);
          }
          console.table(dp);

      }

      return dp[cols - 1][rows - 1];
  }

  // Test cases
  const testCases = [
      { m: 3, n: 7, expected: 28 },
      { m: 3, n: 2, expected: 3 },
      { m: 7, n: 3, expected: 28 },
      { m: 3, n: 3, expected: 6 },
      { m: 1, n: 1, expected: 1 },
  ];

  testCases.forEach((test, index) => {
      const result = uniquePaths(test.m, test.n);
      console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} 
      (Expected: ${test.expected}, Got: ${result})`);
  });
#+end_src

#+RESULTS:
#+begin_example
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
│    1    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 0 │ 0 │ 0 │ 0 │ 0 │
│    1    │ 1 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 0 │ 0 │ 0 │ 0 │
│    1    │ 1 │ 1 │ 0 │ 0 │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 0 │ 0 │ 0 │
│    1    │ 1 │ 1 │ 1 │ 0 │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 0 │ 0 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 0 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 0 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │ 1 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │ 3 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 0 │ 1 │ 3 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 2 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 1 │ 3 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │ 3 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │ 5 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 2 │ 5 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 3 │ 5 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 3 │ 6 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 0 │ 1 │ 3 │ 6 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 2 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 1 │ 3 │ 6 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 3 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 3 │ 6 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │ 6 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │ 8 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 4 │ 8 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 5 │ 8 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 5 │ 9 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 2 │ 5 │ 9 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 3 │ 5 │ 9 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │
├─────────┼───┼───┼───┼───┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │
│    2    │ 0 │ 0 │ 0 │ 1 │ 3 │ 6 │ 9 │
└─────────┴───┴───┴───┴───┴───┴───┴───┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4  │
│    2    │ 0 │ 0 │ 0 │ 1 │ 3 │ 6 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 1 │ 2 │ 3 │ 4  │
│    2    │ 0 │ 0 │ 0 │ 1 │ 3 │ 6 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 2 │ 3 │ 4  │
│    2    │ 0 │ 0 │ 1 │ 1 │ 3 │ 6 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 3 │ 4  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 3 │ 6 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 4  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 6 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │ 10 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │ 12 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 7 │ 12 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 8 │ 12 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 8 │ 13 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 4 │ 8 │ 13 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 5 │ 8 │ 13 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 5 │ 9 │ 13 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 5 │ 9 │ 14 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 2 │ 5 │ 9 │ 14 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 3 │ 5 │ 9 │ 14 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5 │ 6  │
├─────────┼───┼───┼───┼───┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │
│    2    │ 0 │ 0 │ 1 │ 3 │ 6 │ 9 │ 14 │
└─────────┴───┴───┴───┴───┴───┴───┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │
│    2    │ 0 │ 0 │ 1 │ 3 │ 6 │ 10 │ 14 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │
│    2    │ 0 │ 0 │ 1 │ 3 │ 6 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │
│    2    │ 0 │ 0 │ 1 │ 3 │ 6 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 2 │ 3 │ 4  │ 5  │
│    2    │ 0 │ 1 │ 1 │ 3 │ 6 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 3 │ 4  │ 5  │
│    2    │ 0 │ 1 │ 2 │ 3 │ 6 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 4  │ 5  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 6 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 5  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 10 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │ 15 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │ 17 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 11 │ 17 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 12 │ 17 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 12 │ 18 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 7 │ 12 │ 18 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 8 │ 12 │ 18 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 8 │ 13 │ 18 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 8 │ 13 │ 19 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 4 │ 8 │ 13 │ 19 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 5 │ 8 │ 13 │ 19 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 5 │ 9 │ 13 │ 19 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 5 │ 9 │ 14 │ 19 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 5 │ 9 │ 14 │ 20 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 2 │ 5 │ 9 │ 14 │ 20 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 5 │ 9 │ 14 │ 20 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬───┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼───┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 6 │ 9 │ 14 │ 20 │
└─────────┴───┴───┴───┴───┴───┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 6 │ 10 │ 14 │ 20 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 6 │ 10 │ 15 │ 20 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 0 │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 2 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 1 │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 3 │ 4  │ 5  │ 6  │
│    2    │ 1 │ 2 │ 3 │ 6 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 4  │ 5  │ 6  │
│    2    │ 1 │ 2 │ 4 │ 6 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 5  │ 6  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 10 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 6  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 15 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │ 21 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │ 22 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │ 22 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │ 23 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 16 │ 23 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 17 │ 23 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 17 │ 24 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 11 │ 17 │ 24 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 12 │ 17 │ 24 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 12 │ 18 │ 24 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 12 │ 18 │ 25 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 7 │ 12 │ 18 │ 25 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 8 │ 12 │ 18 │ 25 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 8 │ 13 │ 18 │ 25 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 8 │ 13 │ 19 │ 25 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 8 │ 13 │ 19 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 4 │ 8 │ 13 │ 19 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 8 │ 13 │ 19 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 9 │ 13 │ 19 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 9 │ 14 │ 19 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 9 │ 14 │ 20 │ 26 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 9 │ 14 │ 20 │ 27 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 2 │ 5 │ 9 │ 14 │ 20 │ 27 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 5 │ 9 │ 14 │ 20 │ 27 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬───┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼───┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4 │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 9 │ 14 │ 20 │ 27 │
└─────────┴───┴───┴───┴───┴────┴────┴────┘
┌─────────┬───┬───┬───┬────┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3  │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼────┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 10 │ 14 │ 20 │ 27 │
└─────────┴───┴───┴───┴────┴────┴────┴────┘
┌─────────┬───┬───┬───┬────┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3  │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼────┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 10 │ 15 │ 20 │ 27 │
└─────────┴───┴───┴───┴────┴────┴────┴────┘
┌─────────┬───┬───┬───┬────┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3  │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼────┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │ 27 │
└─────────┴───┴───┴───┴────┴────┴────┴────┘
┌─────────┬───┬───┬───┬────┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3  │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼────┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │ 28 │
└─────────┴───┴───┴───┴────┴────┴────┴────┘
┌─────────┬───┬───┬───┬────┬────┬────┬────┐
│ (index) │ 0 │ 1 │ 2 │ 3  │ 4  │ 5  │ 6  │
├─────────┼───┼───┼───┼────┼────┼────┼────┤
│    0    │ 1 │ 1 │ 1 │ 1  │ 1  │ 1  │ 1  │
│    1    │ 1 │ 2 │ 3 │ 4  │ 5  │ 6  │ 7  │
│    2    │ 1 │ 3 │ 6 │ 10 │ 15 │ 21 │ 28 │
└─────────┴───┴───┴───┴────┴────┴────┴────┘
Test Case 1: Passed 
    (Expected: 28, Got: 28)
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 0 │ 0 │
│    1    │ 0 │ 0 │
│    2    │ 0 │ 0 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 0 │
│    2    │ 0 │ 0 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 1 │
│    2    │ 0 │ 0 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 1 │
│    2    │ 0 │ 1 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 1 │
│    2    │ 0 │ 1 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 2 │
│    2    │ 1 │ 1 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 2 │
│    2    │ 1 │ 2 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 2 │
│    2    │ 1 │ 2 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 2 │
│    2    │ 1 │ 3 │
└─────────┴───┴───┘
┌─────────┬───┬───┐
│ (index) │ 0 │ 1 │
├─────────┼───┼───┤
│    0    │ 1 │ 1 │
│    1    │ 1 │ 2 │
│    2    │ 1 │ 3 │
└─────────┴───┴───┘
Test Case 2: Passed 
    (Expected: 3, Got: 3)
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 0 │ 0 │ 0 │
│    1    │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │
│    3    │ 0 │ 0 │ 0 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 0 │
│    1    │ 1 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │
│    3    │ 0 │ 0 │ 0 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 0 │
│    2    │ 0 │ 0 │ 0 │
│    3    │ 0 │ 0 │ 0 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 0 │
│    3    │ 0 │ 0 │ 0 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 0 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 0 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 0 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 1 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 1 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 2 │
│    4    │ 0 │ 0 │ 1 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 2 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 1 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 2 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 2 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
│    3    │ 0 │ 0 │ 2 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 2 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 3 │
│    4    │ 0 │ 0 │ 2 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 3 │
│    4    │ 0 │ 0 │ 3 │
│    5    │ 0 │ 0 │ 2 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 3 │
│    4    │ 0 │ 0 │ 3 │
│    5    │ 0 │ 0 │ 3 │
│    6    │ 0 │ 0 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 3 │
│    4    │ 0 │ 0 │ 3 │
│    5    │ 0 │ 0 │ 3 │
│    6    │ 0 │ 0 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 3 │
│    4    │ 0 │ 0 │ 3 │
│    5    │ 0 │ 0 │ 3 │
│    6    │ 0 │ 0 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 3 │
│    5    │ 0 │ 0 │ 3 │
│    6    │ 0 │ 0 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 4 │
│    5    │ 0 │ 0 │ 3 │
│    6    │ 0 │ 0 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 4 │
│    5    │ 0 │ 0 │ 4 │
│    6    │ 0 │ 0 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 4 │
│    5    │ 0 │ 0 │ 4 │
│    6    │ 0 │ 0 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 4 │
│    5    │ 0 │ 0 │ 4 │
│    6    │ 0 │ 0 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 4 │
│    6    │ 0 │ 0 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 5 │
│    6    │ 0 │ 0 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 5 │
│    6    │ 0 │ 0 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 5 │
│    6    │ 0 │ 0 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 6 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 6 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 2 │
│    2    │ 1 │ 1 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 3 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 4 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 5 │
│    4    │ 0 │ 1 │ 5 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 5 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 6 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 5 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 7 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 5 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
│    3    │ 0 │ 1 │ 5 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 5 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 6 │
│    4    │ 0 │ 1 │ 6 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 6 │
│    4    │ 0 │ 1 │ 7 │
│    5    │ 0 │ 1 │ 7 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 6 │
│    4    │ 0 │ 1 │ 7 │
│    5    │ 0 │ 1 │ 8 │
│    6    │ 0 │ 1 │ 8 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 6 │
│    4    │ 0 │ 1 │ 7 │
│    5    │ 0 │ 1 │ 8 │
│    6    │ 0 │ 1 │ 9 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 6 │
│    4    │ 0 │ 1 │ 7 │
│    5    │ 0 │ 1 │ 8 │
│    6    │ 0 │ 1 │ 9 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 7 │
│    4    │ 0 │ 2 │ 7 │
│    5    │ 0 │ 1 │ 8 │
│    6    │ 0 │ 1 │ 9 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 7 │
│    4    │ 0 │ 2 │ 8 │
│    5    │ 0 │ 1 │ 8 │
│    6    │ 0 │ 1 │ 9 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
│    3    │ 0 │ 2 │ 7 │
│    4    │ 0 │ 2 │ 8 │
│    5    │ 0 │ 1 │ 9 │
│    6    │ 0 │ 1 │ 9 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 8  │
│    5    │ 0 │ 1 │ 9  │
│    6    │ 0 │ 1 │ 10 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 8  │
│    5    │ 0 │ 1 │ 9  │
│    6    │ 0 │ 1 │ 10 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 9  │
│    6    │ 0 │ 1 │ 10 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 10 │
│    6    │ 0 │ 1 │ 10 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 10 │
│    6    │ 0 │ 1 │ 11 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 10 │
│    6    │ 0 │ 1 │ 11 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 11 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 12 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 12 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 2 │ 5  │
│    3    │ 0 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 5  │
│    3    │ 1 │ 2 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 7  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 8  │
│    4    │ 0 │ 2 │ 9  │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 8  │
│    4    │ 0 │ 2 │ 10 │
│    5    │ 0 │ 2 │ 11 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 8  │
│    4    │ 0 │ 2 │ 10 │
│    5    │ 0 │ 2 │ 12 │
│    6    │ 0 │ 2 │ 13 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 8  │
│    4    │ 0 │ 2 │ 10 │
│    5    │ 0 │ 2 │ 12 │
│    6    │ 0 │ 2 │ 14 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 8  │
│    4    │ 0 │ 2 │ 10 │
│    5    │ 0 │ 2 │ 12 │
│    6    │ 0 │ 2 │ 14 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 10 │
│    5    │ 0 │ 2 │ 12 │
│    6    │ 0 │ 2 │ 14 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 11 │
│    5    │ 0 │ 2 │ 12 │
│    6    │ 0 │ 2 │ 14 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 11 │
│    5    │ 0 │ 2 │ 13 │
│    6    │ 0 │ 2 │ 14 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 11 │
│    5    │ 0 │ 2 │ 13 │
│    6    │ 0 │ 2 │ 15 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 11 │
│    5    │ 0 │ 2 │ 13 │
│    6    │ 0 │ 2 │ 15 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 13 │
│    6    │ 0 │ 2 │ 15 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 14 │
│    6    │ 0 │ 2 │ 15 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 14 │
│    6    │ 0 │ 2 │ 16 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 14 │
│    6    │ 0 │ 2 │ 16 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 16 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 17 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 17 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 3 │ 9  │
│    4    │ 0 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 9  │
│    4    │ 1 │ 3 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 12 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 13 │
│    5    │ 0 │ 3 │ 15 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 13 │
│    5    │ 0 │ 3 │ 16 │
│    6    │ 0 │ 3 │ 18 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 13 │
│    5    │ 0 │ 3 │ 16 │
│    6    │ 0 │ 3 │ 19 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 13 │
│    5    │ 0 │ 3 │ 16 │
│    6    │ 0 │ 3 │ 19 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 16 │
│    6    │ 0 │ 3 │ 19 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 17 │
│    6    │ 0 │ 3 │ 19 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 17 │
│    6    │ 0 │ 3 │ 20 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 17 │
│    6    │ 0 │ 3 │ 20 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 20 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 21 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 21 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 22 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 4 │ 14 │
│    5    │ 0 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 22 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 14 │
│    5    │ 1 │ 4 │ 18 │
│    6    │ 0 │ 4 │ 22 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 18 │
│    6    │ 0 │ 4 │ 22 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 19 │
│    6    │ 0 │ 4 │ 22 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 19 │
│    6    │ 0 │ 4 │ 23 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 19 │
│    6    │ 0 │ 4 │ 23 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 20 │
│    6    │ 0 │ 5 │ 23 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 20 │
│    6    │ 0 │ 5 │ 24 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 20 │
│    6    │ 0 │ 5 │ 24 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 20 │
│    6    │ 0 │ 5 │ 25 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 5 │ 20 │
│    6    │ 0 │ 5 │ 25 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 20 │
│    6    │ 1 │ 5 │ 25 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 6 │ 25 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 6 │ 26 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 6 │ 26 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 6 │ 27 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 6 │ 27 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 7 │ 27 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 7 │ 28 │
└─────────┴───┴───┴────┘
┌─────────┬───┬───┬────┐
│ (index) │ 0 │ 1 │ 2  │
├─────────┼───┼───┼────┤
│    0    │ 1 │ 1 │ 1  │
│    1    │ 1 │ 2 │ 3  │
│    2    │ 1 │ 3 │ 6  │
│    3    │ 1 │ 4 │ 10 │
│    4    │ 1 │ 5 │ 15 │
│    5    │ 1 │ 6 │ 21 │
│    6    │ 1 │ 7 │ 28 │
└─────────┴───┴───┴────┘
Test Case 3: Passed 
    (Expected: 28, Got: 28)
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 0 │ 0 │ 0 │
│    1    │ 0 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 0 │
│    1    │ 1 │ 0 │ 0 │
│    2    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 0 │
│    2    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 0 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 1 │
│    2    │ 0 │ 0 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 1 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 2 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 1 │ 2 │
│    2    │ 0 │ 1 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 2 │
│    2    │ 1 │ 1 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 3 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 4 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 2 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 3 │ 5 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 3 │ 6 │
└─────────┴───┴───┴───┘
┌─────────┬───┬───┬───┐
│ (index) │ 0 │ 1 │ 2 │
├─────────┼───┼───┼───┤
│    0    │ 1 │ 1 │ 1 │
│    1    │ 1 │ 2 │ 3 │
│    2    │ 1 │ 3 │ 6 │
└─────────┴───┴───┴───┘
Test Case 4: Passed 
    (Expected: 6, Got: 6)
┌─────────┬───┐
│ (index) │ 0 │
├─────────┼───┤
│    0    │ 0 │
└─────────┴───┘
┌─────────┬───┐
│ (index) │ 0 │
├─────────┼───┤
│    0    │ 1 │
└─────────┴───┘
Test Case 5: Passed 
    (Expected: 1, Got: 1)
undefined
#+end_example
