docs/leets/0062-Unique-Paths.html

<div id="outline-container-orgf62ffa8" class="outline-2">
<h2 id="orgf62ffa8">Setup and Testing Skeleton</h2>
<div class="outline-text-2" id="text-orgf62ffa8">
<div class="org-src-container">
<pre class="src src-js">/**
 * Unique Paths - Determine the number of unique paths from top-left to bottom-right in a grid.
 * @param {number} m - The number of rows.
 * @param {number} n - The number of columns.
 * @returns {number} - The number of unique paths.
 */
function uniquePaths(cols, rows) {
    function rec(col, row) {
        if (col &gt;= cols) {
            return null;
        }

        if (row &gt;= rows) {
            return null;
        }
        return {col, row};
    }


    if (cols === 0 || rows  === 0) {
        return 0;
    }

    const dp = Array(cols).fill(1).map(() =&gt; Array(rows).fill(0));

    console.table(dp);

    let stack = [];

    dp[0][0] = 1;
    stack.push(rec(0,0));
    while (stack.length &gt; 0) {
        let c = stack.pop();
        const right = rec(c.col + 1, c.row);
        const bot = rec(c.col, c.row + 1);

        // console.log(`right = ${JSON.stringify(right)}; bot = ${JSON.stringify(bot)};`)

        if (right) {

            dp[right.col][right.row] += 1;
            stack.push(right);
        }

        if (bot) {
            dp[bot.col][bot.row] += 1;
            stack.push(bot);
        }
        console.table(dp);

    }

    return dp[cols - 1][rows - 1];
}

// Test cases
const testCases = [
    { m: 3, n: 7, expected: 28 },
    { m: 3, n: 2, expected: 3 },
    { m: 7, n: 3, expected: 28 },
    { m: 3, n: 3, expected: 6 },
    { m: 1, n: 1, expected: 1 },
];

testCases.forEach((test, index) =&gt; {
    const result = uniquePaths(test.m, test.n);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} 
    (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
